[탭탭이 환경 설정]
; 파일 명: TapTap.ini
; 주석 기호: ';' 이후는 주석으로 무시
; 환경 변수의 대소문자는 무시 됨.

; 탭탭이 "별칭 입력 상자(Alias Run Box)" 기동 시 사용할 핫키 지정
; Control, Alt, Shift, F1 ~ F12, Esc 등...
; 기본: 컨트롤(Control, Ctrl)키 사용
Hotkey=Control

; 핫키를 두 번 빠르게 눌러서 "별칭 입력 상자(Alias Run Box)" 기동 여부
; 핫키 두 번 누르기: true
; 핫키 한 번만 누르기: false
TapTap=true

; "별칭 입력 상자(Alias Run Box) 기동 시 핫키를 두 번 빠르게 누르는 속도 제한(mSec)
; TapTap=true 로 설정한 경우만 의미 있음.
; 아래 100msec 이하로 설정 불가
TapTapSpeed=300

; 캡스락(CapsLock) 키를 콘트롤(Control) 키로 변경
; 변경: true
; 그냥 그대로 사용: false
CapsLockToLControl=true

; 캡스락(CapsLock) 키를 콘드롤(Control) 키로 사용할 경우,
; 우측 쉬프트(Shift) 키와 캡스락(CapsLock) 키 조합으로 ESC 누름
PressEsc=true

; 캡스락(CapsLock) 키를 콘드롤(Control) 키로 사용할 경우,
; 우측 쉬프트(Shift) 키와 캡스락(CapsLock) 키 조합으로 캡스락 키 On/Off 토글
; PressEsc 가 True일 경우, 우측 쉬프트(Shift) 키와 좌측 컨트롤 키로 On/Off 토글
ToggleCapsLock=true

; 탭탭이 기본 작업 폴더
; 탭탭이가 실행된 폴더로 자동 지정되므로, 변경 및 삭제 불가
; 이하 설정 파일을 찾는 상대 경로의 기본 폴더가 됨.
WorkingFolder=

; 탭탭이 기본 설정 파일 정보
; IniFile=WorkingFolder\Lib\TapTap.ini

; 탭탭이 별칭 리스트 설정 파일
; "WorkingFolder"를 기본 작업 폴더 이름으로 사용하여 지정
AliasList=WorkingFolder\Lib\AliasList.ini

; 탭탭이 별칭 입력 상자(Alias Run Box, ARB)의 배경 색(0xRGB)
ArbBackground=1E1E1E

; 탭탭이 별칭 입력 상자(Alias Run Box, ARB)의 편집 창 폭 사이즈(Pixel)
ArbWidth=320

; 탭탭이 별칭 입력 상자(Alias Run Box, ARB)의 편집 창 폰트
ArbEditFont=나눔고딕

; 탭탭이 별칭 입력 상자(Alias Run Box, ARB)의 편집 창 폰트 사이즈
ArbEditFontSize=S18

; 탭탭이 별칭 입력 상자(Alias Run Box, ARB)의 편집 창 폰트 굵기
ArbEditFontWeight=W1000

; 탭탭이 별칭 입력 상자(Alias Run Box, ARB)의 편집 창 글자 색(0xRGB)
ArbEditColor=D4D4D4

; 탭탭이 별칭 입력 상자(Alias Run Box, ARB)의 편집 창 배경 색(0xRGB)
ArbEditBackground=1E1E1E

; 탭탭이 별칭 입력 상자(Alias Run Box, ARB)의 리스트 창 행 갯수
ArbListRows=6

; 탭탭이 별칭 입력 상자(Alias Run Box, ARB)의 리스트 창 폰트
ArbListFont=나눔고딕

; 탭탭이 별칭 입력 상자(Alias Run Box, ARB)의 리스트 창 폰트 사이즈
ArbListFontSize=S12

; 탭탭이 별칭 입력 상자(Alias Run Box, ARB)의 리스트 창 폰트 굵기
ArbListFontWeight=W800

; 탭탭이 별칭 입력 상자(Alias Run Box, ARB)의 리스트 창 글자 색(0xRGB)
ArbListColor=CCCCCC

; 탭탭이 별칭 입력 상자(Alias Run Box, ARB)의 리스트 창 배경 색(0xRGB)
ArbListBackground=1E1E1E

; 탭탭이 별칭 입력 상자(Alias Run Box, ARB)의 우하 x축 위치 보정값(Pixel)
ArbMoveX=410

; 탭탭이 별칭 입력 상자(Alias Run Box, ARB)의 우하 y축 위치 보정값(Pixel)
ArbMoveY=220

; 화면 보호기 실행
; 화면 보호기 사용: true
; 화면 보호기 비 사용: false
NeedScreenSavering=true

; 화면 보호기 실행 방법
; 마우스 위치에 따라 화면 보호기 실행
; 마우스 코너 위치: LeftTop, RightTop, LeftBottom, RightBottom
; 마우스가 벽에 부딪치는 위치: LeftWall, TopWall, RightWall, BottomWall
ScreenSaverOnMouse=LeftTop

; 탭탭이 전용 AutoHotkey(AutoHotkeyU64.exe v1.1.33.10)
; 기존에 설치한 AutoHotkey를 사용할 경우, AutoHotkey.exe의 설치 경로를 입력하여 사용할 수 있음.
AutoHotkeyExe=WorkingFolder\Lib\_Bin\AutoHotkey.exe
; AutoHotkey=c:\Program Files\AutoHotkey\AutoHotkey.exe

; 탭탭이가 자동으로 찾는 .ahk 파일 폴더(AutoHotkey)
AhkFolder=WorkingFolder\Lib\AHK

; .py 파일 폴더 내의 Python 스크립트 실행을 위한 Python 설치 경로
PythonExe=c:\App\Prog\Miniconda3\python.exe

; 탭탭이가 자동으로 찾는 .py 파일 폴더(Python)
PythonFolder=WorkingFolder\Lib\Python

; 탭탭이 기본 에디터
Editor=notepad.exe
;Editor=c:\App\Prog\vim\vim82\gvim.exe
